Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_Clinic of Horrors.tmx
Source language: en
Languages: es_419

source: They’re not living!
es_419: ¡No están viviendo!

source: Don’t worry about that.
es_419: No te preocupes por eso.

source: 14 Hours later...
es_419: Luego de 14 horas…

source: It has only been sixty seconds.
es_419: Solo pasaron 60 segundos.

source: How can an environmental mutation grow this big...?
es_419: ¿Cómo una mutación ambiental puede crecer así?

source: They take care of your every need while you basically live your life inside a game!
es_419: ¡Se encargan de todas tus necesidades mientras tú vives dentro de un juego!

source: Merryweather is the lead writer of Merryweather Comics, he is known as the writer for Winter Moon, Stalker x Stalker, Internet Explorer, Meme Girls, and Everywhere & Nowhere, among many others.
es_419: Merryweather es el escritor principal de Merryweather Comics, y es conocido por escribir Winter Moon, Stalker X Stalker, Internet Explorer, Meme Girls y Everywhere & Nowhere, entre otros.

source: It’ll happen from time to time.
es_419: Sucede de vez en cuando.

source: Please!! put me back!!
es_419: ¡¡Por favor!! ¡¡Quiero volver!!

source: CAPITAL City Library
es_419: Biblioteca Ciudad Capital

source: ...Wha?!
es_419: …¡¿Qué?!

source: So, what do you think?
es_419: Entonces, ¿qué dices?

source: Y...you can’t do this!
es_419: ¡N…no pueden hacer esto!

source: You went along with this experiment as much as we did!
es_419: ¡Usted continuó con este experimento como todos nosotros!

source: 2 months later...
es_419: 2 meses después…

source: *clink*
es_419: *clinc*

source: And we have a winner!
es_419: ¡Y tenemos a la ganadora!

source: It’ll be okay.
es_419: Todo mejorará.

source: Nice job, Bianca!
es_419: ¡Bien hecho, Bianca!

source: i have money.
es_419: Te pagaré.

source: Do you need anything?
es_419: ¿Necesita algo?

source: Didn’t that make you feel better?
es_419: ¿No te hizo sentir mejor?

source: Don’t worry, we’ll take care of this!
es_419: ¡No se preocupe! Lo resolveremos.

source: Could you scratch me?
es_419: ¿Podrías rascarme?

source: Why haven’t the police just taken it out?
es_419: ¿por qué la policía no se deshace de eso?

source: Please!
es_419: ¡Por favor!

source: Their muscles will waste away if they don’t use them!
es_419: ¡Sus músculos se debilitarán si no los usan!

source: Maybe we can set you up with the premium service!
es_419: ¡Tal vez podemos darte el servicio prémium!

source: What would you like to know?
es_419: ¿Qué quieres saber?

source: I was kinda curious.
es_419: Tengo curiosidad.

source: 5 minutes later...
es_419: 5 minutos después…

source: So, Bianca,
es_419: Em, Bianca,

source: There are no limits!
es_419: ¡No hay límites!

source: Omg!
es_419: ¡Noo!

source: @_Ariyashi_ on
es_419: @_Ariyashi_ en

source: How can he not feel this?
es_419: ¿Cómo puede no dolerle?

source: Clinic of Horrors is her first time working on a comic, and frequently draws inspiration from the anime/manga she grew up with."
es_419: Clinic of Horrors es el primer cómic en el que trabaja. A menudo hace dibujos inspirados en los animes/mangas con los que creció.”

source: Live
es_419: En vivo

source: Killing a mutated body the size of a ten story building will be impractical to remove.
es_419: ¡Matar a una mutación del tamaño de un edificio de diez pisos dificultaría su extracción!

source: I’ll... be right... there...
es_419: En… Enseguida… voy…

source: We provide regular painkillers through his feeding tube.
es_419: le damos analgésicos con regularidad a través del tubo de alimentación.

source: I have an Itch...
es_419: Tengo comezón…

source: For a 50 cent monthly fee,
es_419: Por 50 centavos al mes,

source: Just imagine it!
es_419: ¡Solo imagínalo!

source: Our cheapest package is just $199!
es_419: ¡Nuestro paquete más barato solo cuesta $199!

source: Almost there...
es_419: Casi casi…

source: @Mochi.kattdraws on
es_419: @Mochi.kattdraws en

source: Let’s operate.
es_419: ¡A operar!

source: of course.
es_419: Por supuesto.

source: The player is informed that he has to take his daily dose of vitamins, proteins, and fibers.
es_419: Se le informa al jugador que debe tomar su dosis diaria de vitaminas, proteínas y fibras.

source: Hmm...
es_419: Mmm…

source: We’ll let you play whatever games you want, forever!
es_419: ¡Te dejaremos jugar a lo que quieras para siempre!

source: Want to play your favorite game forever?
es_419: ¿Quieres jugar a tu juego favorito para siempre?

source: You’ve been so grumpy lately!
es_419: ¡Últimamente has estado de mal humor!

source: He’ll be fine.
es_419: Estará bien.

source: What were you doing all the way out here anyways?
es_419: Por cierto, ¿qué hacías por aquí?

source: Play in
es_419: ¡Juegue con

source: HAPPY!
es_419: ¡FELICIDAD!

source: You’re not from around here, are you?
es_419: No es de por aquí, ¿no?

source: I’m curious.
es_419: Tengo curiosidad.

source: Pfaaaahahahahah
es_419: Ffuaajajajajaja

source: This place, it’s...
es_419: Este lugar es…

source: It’s okay officer.
es_419: Está bien, oficial.

source: Just ignore it.
es_419: Ignórelo.

source: Thank you for 500k+ subscribers!
es_419: ¡Gracias por los 500k+ suscriptores!

source: @ichigobutterfly1603 on
es_419: @ichigobutterfly1603 en

source: My name is BUFFBIANCA
es_419: Me llamo SUPERBIANCA

source: You’re a local practioner.
es_419: si es un médico local?

source: I’m so excited!
es_419: ¡Estoy muy emocionado!

source: Put me back, please!!
es_419: ¡¡Por favor, quiero volver!!

source: But for a higher fee, we do have other options.
es_419: Pero si pagan más, tenemos otras opciones.

source: We’ll just put him outside the building.
es_419: Lo llevaremos afuera del edificio.

source: No more working!
es_419: ¡Nada de trabajar!

source: Here we are!
es_419: ¡Llegamos!

source: We’re family.
es_419: Somos una familia.

source: A trap, huh.
es_419: Una trampa, eh.

source: Wonderful, isn’t it?
es_419: Maravilloso, ¿no lo crees?

source: The experimental pill was consumed by a subject in the east district.
es_419: Un sujeto en el distrito este ingirió la píldora experimental.

source: Your mom is a very smart woman.
es_419: Tu madre es un mujer muy inteligente.

source: What is it?
es_419: ¿Qué pasa?

source: Huhh... hhhuhhh... s... someone, please help me...
es_419: Aahh… aaaahhh… a… alguien, por favor, ayúdeme…

source: Every few days when I’m at this platform, I hear that same cry for help.
es_419: Cada tantos días cuando estoy en esta plataforma, escucho ese mismo grito por ayuda.

source: We have a patient to treat.
es_419: Tenemos un paciente que curar.

source: I see...
es_419: Ya veo…

source: Simply unadulterated experience.
es_419: Una experiencia pura.

source: All they care about is getting our money.
es_419: Solo les importa obtener nuestro dinero.

source: INFO FOR
es_419: INF COMO

source: Clinic of Horrors
es_419: Clínica del terror

source: Our state-of-the-art full vr headset gives him complete control through a simple brain implant that reroutes his nerve impulses!
es_419: ¡Nuestro casco moderno de RV le otorga un control completo a través de un implante cerebral que redirige sus impulsos nerviosos!

source: Why did those leaks only come from corners?
es_419: ¿Por qué solo se filtran por las esquinas?

source: So... have there been any protestors?
es_419: Y… ¿alguien se ha quejado?

source: ...huh?!?
es_419: … ¿¡¿eh?!?

source: Don’t worry, I brought your medicine!
es_419: ¡No se preocupe, le traje su medicina!

source: And nobody ever helps?
es_419: ¿Y nadie ayuda?

source: How was that only six months?
es_419: ¿Eso fueron seis meses?

source: What are these tablets for, doctor?
es_419: ¿Para qué son las tablets, Doctor?

source: Do want to run a dungeon with me?
es_419: ¿Quieres ir al calabozo conmigo?

source: Mister Yellow!
es_419: Señor Amarillo!

source: Chsh
es_419: Uggh

source: We have lots of work to do!
es_419: ¡Tenemos mucho trabajo que hacer!

source: I’m good!
es_419: ¡Estoy bien!

source: Huah...
es_419: Muaa…

source: Peter really my dad?
es_419: Peter es en verdad mi padre?

source: Okay... sorry mom...
es_419: Está bien… Perdón, mamá…

source: What is this?
es_419: ¿Qué es esto?

source: I think you need medical attention, old man.
es_419: Creo que necesita atención medica, señor.

source: I’m getting an energy drink.
es_419: Iré por una bebida energética.

source: Don’t ignore me, doctor.
es_419: No me ignore, doctor.

source: Merry christmas, Bianca!
es_419: ¡Feliz Navidad, Bianca!

source: Stop wriggling.
es_419: Deje de moverse.

source: We’re nearly there!
es_419: ¡Ya casi llegamos!

source: So how about it?
es_419: ¿Y qué?

source: KYAAAH!!
es_419: ¡¡AAAHH!!

source: Game... start!
es_419: ¡El juego… comienza!

source: With this new technology, it can finally be done...
es_419: Con esta nueva tecnología, por fin se podrá completar…

source: You look well-off.
es_419: Parece que tienes dinero.

source: Doctor, we are ready to execute your plan!
es_419: ¡Doctor, estamos listos para continuar con su plan!

source: Hmmmm?
es_419: ¿Mmmnnn?

source: Each room is equipped with a vr helmet, a gaming pc, and a comfortable chair!
es_419: ¡Cada habitación está equipada con un casco de RV, una buena pc y una silla cómoda!

source: Please don’t do this!!
es_419: ¡¡Por favor, no hagan esto!!

source: DISCONNECTED
es_419: DESCONECTADO

source: What’s his diet like?
es_419: ¿Cómo es su dieta?

source: ENERGY!
es_419: ¡ENERGÍA!
